[{"title": "Butter chicken (Rice bowls) ", "content": "460 calories \r\n38 grams protein \r\n50 carbs \r\n11 grams of fat \r\n\r\n(Butter chicken only) \r\n260 calories \r\n34g protein \r\n7g carbs \r\n11g fat\r\n\r\nIngredients- \r\n30g butter \r\n2 onions, chopped \r\n2 tbsp tomato paste\r\n2 tbsp garlic paste \r\n2 tbsp ginger paste \r\n2 tbsp paprika \r\n1 tsp cayenne pepper \r\n2 tbsp garam masala \r\n1 tsp cumin \r\n1 tsp coriander \r\n2 tsp salt \r\nDash black pepper\r\n\r\n1x 14oz can crushed fire roasted tomatoes \r\n1/2 cup water \r\n\r\nOptional to add when blending- \r\n1 tbsp chicken bouillon \r\n1 tbsp sugar/0 cal sweetener \r\n\r\n32 oz diced chicken breast \r\n\r\nCrockpot-\r\nHigh 2-3 hours \r\nLow 3-4 hours \r\n\r\n250g plain nonfat green yogurt \r\n30g butter \r\n\r\nFor rice bowls- \r\n420g basmati rice \r\n~630 ml water \r\nCook and evenly distro for 7 servings \r\n\r\nSauté onions in butter, add all listed spices over sautéd onions and cook until evenly mixed \r\n\r\nPour onion/spice mix into blender and blend until creamy. \r\n\r\nAdd 32oz chicken to crockpot and pour the mix you just made over the chicken. Cook on high 2-3 hours or low 3-4 hours \r\n\r\nOnce finished add butter and Greek yogurt to the pot and stir until evenly mixed. \r\n\r\nMake 7 servings of basmati rice and serve butter chicken over rice.\r\nVeggie enchiladas \r\n4 tortillas, warmed up in paper towel in microwave\r\n1 can black beans\r\n1/2 red onion, diced\r\n1 or 2 bell peppers, any color, diced or sliced\r\n1 packet taco seasoning\r\n2 medium sweet potatoes\r\n1 1/2T olive oil\r\n1T paprika\r\n1t chili powder\r\n1t turmeric\r\n1 large can mild red enchilada sauce (Old El Paso brand is our fav)\r\n1/2 cup Mexican cheese\r\n\r\nPreheat oven to 425 degrees. Prepare sweet potatoes by peeling and cutting into small cubes. Place on medium to large sized sheet pan covered with parchment paper and coat in ~1T of olive oil. Sprinkle paprika, chili powder, and turmeric and toss the diced sweet potatoes to evenly cover. Put sweet potatoes in the oven for ~15-20 mins. \r\n\r\nWhile the sweet potatoes cook, drain and rinse the black beans. Heat 1/2T of olive oil in a large pan over medium heat. Add diced red onions and diced/sliced bell peppers. Allow to cook for 3-5 minutes before adding in black beans. Cool for another 2-3 minutes. Add in taco seasoning and stir to coat evenly. Let sit in the pan on the burner, but turn the heat off. \r\n\r\nOnce the sweet potatoes are done, remove from oven and combine with the black beans. Stir evenly. Turn oven to 350 degrees. Place a heaping scoop of the black bean & sweet potato mixture into each of the 4 tortillas. Roll tortillas up, but don’t fold in the ends. Place into glass or ceramic pan. Once all tortillas are filled and in the pan, coat evenly with the enchilada sauce. Make sure you shimmy the enchiladas around to get the sauce in between each enchilada. Add Mexican cheese. \r\n\r\nPlace the glass or ceramic pan in the oven (at 350 degrees) and let cook for 10-15 minutes, or until cheese is melted. Remove from oven and let cool for 5-10 minutes. Serve!", "username": "bb3.user"}, {"title": " Carne Asada Street Tacos", "content": "Ingredients:\r\n\r\n1 pound skirt steak (or flank)\r\n1 tablespoon olive oil\r\n1 cup orange juice\r\n1 lime (juiced)\r\n1 tablespoon chopped cilantro\r\n1 teaspoon salt\r\n1 teaspoon fresh ground pepper\r\n2 teaspoons cumin\r\n5 cloves garlic (cracked)\r\nInstructions:\r\n\r\nMarinate the steak with olive oil, orange juice, lime juice, cilantro, salt, pepper, cumin, and garlic for at least 1 hour.\r\nGrill the steak to your desired doneness and slice thinly.\r\nServe on warm tortillas with your favorite toppings like diced onions, cilantro, and lime juice", "username": "bb3.user"}]